介绍关于android

innovative （创新） /  combination （结合）/ 
distinct （截然不同的） /  invoked （调用） /
individually （单独）/  interface （接口）/
performs （执行） /  invoke  （调用） /
adaptive （自适应） /  determines  （决定了） /
query （查询） /  availability  （可用性）/
features  （特性） /  runtime  （运行时） /
hardware  （硬件）/  declare  （声明） /

本人翻译：

Android提供了一个丰富的应用的框架，他允许你去建立创新的应用和游戏对于手机驱动在java语言环境中。文档列在了左边的导航提供详情是关于如何
使用android的文档去建立app应用。
如果你打算去更新android开发，该文档能帮助你理解下列的基本概念关于android的应用框架。

app应用提供了许多尝试点
android应用结合各种不同的组件了可以单独调用。例如一个单独的activity提供了给开发者一个单独的接口，并且一个服务决定在后台执行。

从一个组件你可以启动自另外一个意图。你甚至可以从另一个app来启动一个组件，比如一个activity在地图中去展示一个地址。这个模块提供了许多进入点
对于一个单独的app并且允许任何app应用表现的像一个用户的默认的动作，让其他任何应用可以调用

应用适应不同的驱动

android提供了一个自适应的应用框架，允许你提供不同的方式对于不同驱动的配置。例如：你可以创建不同的xml布局文件对于不同的屏幕尺寸和系统提供的
布局，应用在当前的驱动屏幕上。

如果任何有应用的特性需要硬件的支持，你可以在运行的时候查询可行的驱动特性。如果必要的话，你也可以声明你的app需要的特性，因为使用市场像谷歌
应用商城不允许在驱动上安装不支持的特性。



翻译器翻译：

Android提供了丰富的应用程序框架，允许您在Java语言环境中为移动设备构建创新的应用程序和游戏。左侧导航中列出的文档提供了有关如何使用Android
的各种API构建应用程序的详细信息。

Android应用程序构建为可以单独调用的不同组件的组合。例如，单个活动为用户界面提供单个屏幕，并且服务在后台独立执行工作。

从一个组件中，您可以使用intent启动另一个组件。您甚至可以在其他应用中启动组件，例如地图应用中的活动以显示地址。此模型为单个应用程序提供
多个入口点，并允许任何应用程序作为用户对其他应用程序可能调用的操作的“默认”行为。

Android提供了一个自适应应用程序框架，允许您为不同的设备配置提供独特的资源。例如，您可以为不同的屏幕大小创建不同的XML布局文件，系统根据
当前设备的屏幕大小确定要应用的布局。

如果任何应用程序功能需要特定硬件（如摄像头），则可以在运行时查询设备功能的可用性。如有必要，您还可以声明应用所需的功能，以便Google Play
商店等应用市场不允许在不支持该功能的设备上安装。